# loc and iloc

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('D:\\ml\\datasets\\corporate.csv')
df

   ID   Name    Companies       Profit Growth
0   1   lisa  IT Services    5634256.0    20%
1   2   neha      Finance  324543279.0    12%
2   3  risav       Health          NaN    58%
3   4    doj  IT Services          NaN    60%
4   5   Mark          NaN    5678337.0    NaN
5   6    NaN          NaN          NaN    49%

In [5]:
df.loc[0] #access each row. This value indiccate the label

ID                     1
Name                lisa
Companies    IT Services
Profit         5634256.0
Growth               20%
Name: 0, dtype: object

In [7]:
df.loc[[0,1]] #prints two rows as 0th row and 1th row

   ID  Name    Companies       Profit Growth
0   1  lisa  IT Services    5634256.0    20%
1   2  neha      Finance  324543279.0    12%

In [9]:
df.loc[[2,4]] #access two row with 2nd and 4th index

   ID   Name Companies     Profit Growth
2   3  risav    Health        NaN    58%
4   5   Mark       NaN  5678337.0    NaN

In [12]:
df.loc[2,'Growth']

'58%'

In [20]:
df.loc[2:1,'Growth'] #can't print elements cuz starting index is > last index

Series([], Name: Growth, dtype: object)

In [21]:
df.loc[2:4,'Growth']

2    58%
3    60%
4    NaN
Name: Growth, dtype: object

In [31]:
df.loc[[True, False, True, True, True, True]] #ignoring the index of False and printing the rows with true index number

   ID   Name    Companies     Profit Growth
0   1   lisa  IT Services  5634256.0    20%
2   3  risav       Health        NaN    58%
3   4    doj  IT Services        NaN    60%
4   5   Mark          NaN  5678337.0    NaN
5   6    NaN          NaN        NaN    49%

In [44]:
df.loc[df['Growth'] < 70% ]

SyntaxError: invalid syntax (3048468893.py, line 1)

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('D:\\ml\\datasets\\corporate.csv')
df

   ID   Name    Companies       Profit Growth
0   1   lisa  IT Services    5634256.0    20%
1   2   neha      Finance  324543279.0    12%
2   3  risav       Health          NaN    58%
3   4    doj  IT Services          NaN    60%
4   5   Mark          NaN    5678337.0    NaN
5   6    NaN          NaN          NaN    49%

In [3]:
df.iloc[0]

ID                     1
Name                lisa
Companies    IT Services
Profit         5634256.0
Growth               20%
Name: 0, dtype: object

In [4]:
df.iloc[:,0]

0    1
1    2
2    3
3    4
4    5
5    6
Name: ID, dtype: int64

In [5]:
df.iloc[0,1]

'lisa'

In [7]:
df.iloc[[0,1]]

   ID  Name    Companies       Profit Growth
0   1  lisa  IT Services    5634256.0    20%
1   2  neha      Finance  324543279.0    12%

In [11]:
df.iloc[[True, False, True, True, True, True]]

   ID   Name    Companies     Profit Growth
0   1   lisa  IT Services  5634256.0    20%
2   3  risav       Health        NaN    58%
3   4    doj  IT Services        NaN    60%
4   5   Mark          NaN  5678337.0    NaN
5   6    NaN          NaN        NaN    49%